Tekla Open API Reference for Tekla Structures 2025
Text.TextAttributes.UseWordWrapping Property
 Gets or sets a value indicating whether to [use word wrapping].
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseWordWrapping { get; set; }
Public Property UseWordWrapping As Boolean
	Get
	Set
Property Value
Type: Boolean
true if [use word wrapping]; otherwise, false.
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace